public  class Main {
    public static void main(String[] args){
        /*Задание 1.1
Напишите фрагмент класса (группу комманд), который будет присваивать значения 5 и 9 двум переменным,
а затем третья переменная будет получать значение, равное сумме значений первых двух переменных.
         */
    int value1=5, value2=9;
    int sum=value1+value2;
    System.out.println(sum);

}
}
