public class Main {
public static void main  (String [] args) {
    /*Задание 1.4 Напишите фрагмент класса, который присваивает переменной х целочисленное значение,
    а затем присваивает переменной треть от значения переменной х.
    */
    int x =3;
    x /=3;
    System.out.println(x);
}
}
