public class Main {
public static void main  (String [] args) {
    /*Задание 1.6 Напиши программу, которая выводит на экран квадрат переменной number;
*/
    int number = 50;
    int pow = 2;
    System.out.println(Math.pow(number, pow));
}
}
